namespace Correctum.Enums
{
    /// <summary>
    /// Указывает тип позиции
    /// </summary>
    public enum PositionType : byte
    {
        Unknown = 0,
        /// <summary>
        /// Товар, за исключением подакцизного товара и товара, подлежащего 
        /// маркировке средствами идентификации 
        /// </summary>
        Product = 1,
        /// <summary>
        /// Подакцизный товар, за исключением товара, подлежащего маркировке 
        /// средствами идентификации
        /// </summary>
        Excise = 2,
        /// <summary>
        /// Выполняемая работа
        /// </summary>
        Work = 3,
        /// <summary>
        /// Оказание услуги
        /// </summary>
        Service = 4,
        /// <summary>
        /// Прием ставок при осуществлении деятельности по проведению азартных игр
        /// </summary>
        Gambling = 5,
        /// <summary>
        /// Выплата денежных средств в виде выигрыша при осуществлении деятельности
        /// по проведению азартных игр
        /// </summary>
        GamblingWin = 6,
        /// <summary>
        /// Прием денежных средств при реализации лотерейных билетов, электронных 
        /// лотерейных билетов, приеме лотерейных ставок при осуществлении 
        /// деятельности по проведению лотерей
        /// </summary>
        Lottery = 7,
        /// <summary>
        /// Выплата денежных средств в виде выигрыша при осуществлении деятельности 
        /// по проведению лотерей
        /// </summary>
        LotteryWin = 8,
        /// <summary>
        /// Предоставление прав на использование результатов интеллектуальной 
        /// деятельности или средств индивидуализации
        /// </summary>
        IntellectualProperty = 9,
        /// <summary>
        /// Аванс, задаток, предоплата, кредит
        /// </summary>
        Payment = 10,
        /// <summary>
        /// Вознаграждение пользователя, являющегося платежным агентом (субагентом), 
        /// банковским платежным агентом (субагентом), комиссионером, поверенным 
        /// или иным агентом
        /// </summary>
        Agent = 11,
        /// <summary>
        /// Взнос в счет оплаты, пени, штрафе, вознаграждении, бонусе и ином 
        /// аналогичном предмете расчета
        /// </summary>
        Forfeit = 12,
        /// <summary>
        /// Другое
        /// </summary>
        Other = 13,
        /// <summary>
        /// Передача имущественного права
        /// </summary>
        PropertyLaw = 14,
        /// <summary>
        /// Внереализационный доход
        /// </summary>
        NonOperatingIncome = 15,
        /// <summary>
        /// Cумма расходов, платежей и взносов, указанных в подпунктах 2 и 3 пункта 
        /// <see href="https://www.consultant.ru/document/cons_doc_LAW_495617/">
        /// Налогового кодекса Российской Федерации</see>, уменьшающих сумму налога
        /// </summary>
        OtherPayment = 16,
        /// <summary>
        /// Cумма уплаченного торгового сбора
        /// </summary>
        TradeFee = 17,
        /// <summary>
        /// туристическом налоге
        /// </summary>
        ResortFee = 18,
        /// <summary>
        /// Залог
        /// </summary>
        Deposit = 19,
        /// <summary>
        /// Сумма произведенных расходов в соответствии со 
        /// <see href="https://www.consultant.ru/document/cons_doc_LAW_527232/2428f19fbea7040de2388dd179c39e787cc0d07d/#dst103624">
        /// статьей 346.16 Налогового кодекса Российской Федерации</see>, 
        /// уменьшающих доход
        /// </summary>
        Outcome = 20,
        /// <summary>
        /// Страховой взнос на обязательное пенсионное страхование, уплачиваемых 
        /// ИП, не производящими выплаты и иные вознаграждения физическим лицам
        /// </summary>
        PensionInsuranceIE = 21,
        /// <summary>
        /// Страховой взнос на обязательное пенсионное страхование, уплачиваемых 
        /// организациями и ИП, производящими выплаты и иные вознаграждения 
        /// физическим лицам
        /// </summary>
        PensionInsurance = 22,
        /// <summary>
        /// Страховой взнос на обязательное медицинское страхование, уплачиваемых 
        /// ИП, не производящими выплаты и иные вознаграждения физическим лицам
        /// </summary>
        MedicalInsuranceIE = 23,
        /// <summary>
        /// Страховой взнос на обязательное медицинское страхование, уплачиваемые 
        /// организациями и ИП, производящими выплаты и иные вознаграждения 
        /// физическим лицам
        /// </summary>
        MedicalInsurance = 24,
        /// <summary>
        /// Страховой взнос на обязательное социальное страхование на случай 
        /// временной нетрудоспособности и в связи с материнством, на обязательное
        /// социальное страхование от несчастных случаев на производстве и 
        /// профессиональных заболеваний
        /// </summary>
        SocialInsurance = 25,
        /// <summary>
        /// Прием и выплат денежных средств при осуществлении казино и залами 
        /// игровых автоматов расчетов с использованием обменных знаков 
        /// игорного заведения
        /// </summary>
        Casino = 26,
        /// <summary>
        /// Выдача денежных средств банковским платежным агентом
        /// </summary>
        /// <remarks>Используется в ФФД 1.2</remarks>
        FromBankAgent = 27,
        /// <summary>
        /// Подакцизном товар, подлежащий маркировке средством идентификации, 
        /// не имеющий кода маркировки
        /// </summary>
        /// <remarks>Используется в ФФД 1.2</remarks>
        ExciseNonMark = 30,
        /// <summary>
        /// Подакцизном товар, подлежащий маркировке средством идентификации, 
        /// имеющий код маркировки
        /// </summary>
        /// <remarks>Используется в ФФД 1.2</remarks>
        ExciseMark = 31,
        /// <summary>
        /// Товар, подлежащий маркировке средством идентификации, не имеющий 
        /// кода маркировки, за исключением подакцизного товара
        /// </summary>
        /// <remarks>Используется в ФФД 1.2</remarks>
        NonMark = 32,
        /// <summary>
        /// Товар, подлежащий маркировке средством идентификации, имеющий код 
        /// маркировки, за исключением подакцизного товара
        /// </summary>
        /// <remarks>Используется в ФФД 1.2</remarks>
        Mark = 33,
    }
}